TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/гкс_ПрибытиеСуднаНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ПрибытиеСуднаНаПЛК</name>
  <basedOn>Document.гкс_Фрахт</basedOn>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ТранспортныеДокументыФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеДокументы</name>
    <attributes>
      <name>ТранспортныйДокумент</name>
      <type>
        <types>DocumentRef.гкс_ТранспортныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВТрюме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ТранспортныйДокумент/гкс_ТранспортныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ТранспортныйДокумент</name>
  <registerRecords>InformationRegister.гкс_ЖДНакладныеВагона</registerRecords>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.гкс_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДокументПЛК</name>
    <comment>Документ создан в текущей базе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/Forms/ПомощникЗаполнения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Фрахт", Фрахт) Тогда
		ТекстСообщения = НСтр("ru = 'Форма не предназначена для непосредственного использования'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ДанныеФрахта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Фрахт, "Судно,ПланОбработкиСудна");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКоносаментов, "ОтборСудно", ДанныеФрахта.Судно);
	ПланОбработкиСудна.Загрузить(ДанныеФрахта.ПланОбработкиСудна.Выгрузить());
	ПланОбработкиСудна.Сортировать("Трюм");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКоносаментов

&НаКлиенте
Процедура СписокКоносаментовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для Каждого ИдентификаторСтроки Из Элементы.ПланОбработкиСудна.ВыделенныеСтроки Цикл
		ТекущиеДанные = ПланОбработкиСудна.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТекущиеДанные.ТранспортныйДокумент = Элементы.СписокКоносаментов.ТекущаяСтрока;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокКоносаментовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", Строки.ПолучитьКлючи());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка КАК Ссылка,
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ВесПоДокументу
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка В(&Ссылки)
	|СГРУППИРОВАТЬ ПО
	|	ТранспортныйДокументТранспортныеСредства.Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.Ссылка];
		СтрокаСписка.Данные["ВесПоДокументу"] = Выборка.ВесПоДокументу;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПрибытиеСуднаНаПЛК(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ДокументПрибытия = СоздатьПрибытиеСуднаНаПЛКНаСервере();
		Если Не ДокументПрибытия = Неопределено Тогда
			Закрыть(ДокументПрибытия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьПрибытиеСуднаНаПЛКНаСервере()
	
	Результат = Неопределено;
	ДокументПрибытия = Документы.гкс_ПрибытиеСуднаНаПЛК.СоздатьДокумент();
	ДокументПрибытия.Заполнить(Фрахт);
	ДокументПрибытия.Отправитель = Отправитель;
	Для Каждого СтрокаПлана Из ПланОбработкиСудна Цикл
		СтрокаДокумента = ДокументПрибытия.ТранспортныеДокументы.Найти(СтрокаПлана.Трюм, "Трюм");
		Если Не СтрокаДокумента = Неопределено Тогда
			СтрокаДокумента.ТранспортныйДокумент = СтрокаПлана.ТранспортныйДокумент;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ДокументПрибытия.Записать(РежимЗаписиДокумента.Проведение);
		Результат = ДокументПрибытия.Ссылка;
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СообщениеДляЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		СообщениеДляПользователя = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.Проверка заполнения'"),
			УровеньЖурналаРегистрации.Ошибка,,, СообщениеДляЖурнала);
		ОбщегоНазначения.СообщитьПользователю(СообщениеДляПользователя);

	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
